{
    "A new emerald block has shown up. Make a repeating command block that replaces that emerald block with a gold block.": "A new emerald block has shown up. %s",
    "A new gold block has appeared! Replace it with a waterlogged lower cobblestone slab.": "A new gold block has appeared! %s.",
    "Activate the command chain in survival mode": "Activate the command chain in survival mode",
    "Actually, changed my mind - I've turned it off again.": "Actually, changed my mind - I've turned it off again.",
    "Add 10 to your 'fun' score": "Add 10 to your '%s' score",
    "Add the 'cheater' tag to yourself": "Add the '%s' tag to yourself",
    "Add the 'cute' tag to all cats": "Add the '%s' tag to all cats",
    "Add the tag 'cheater' to yourself": "Add the tag '%s' to yourself",
    "As the final exercise in this lesson, make a repeating command block give you a cookie.": "As the final exercise in this lesson, %s",
    "Block States": "Block States",
    "Block States Tutorial": "Block States Tutorial",
    "Chain replacing diamond block with redstone block & teleport on top": "Chain replacing diamond block with redstone block & teleport on top",
    "Changing the World": "Changing the World",
    "Changing the World Tutorial": "Changing the World Tutorial",
    "Checking, please stand by...": "Checking, please stand by...",
    "Click the link below to skip the introduction.": "Click the link below to skip the introduction.",
    "Click the link in the chat": "Click the link in the chat",
    "Command Basics": "Command Basics",
    "Command Basics Tutorial": "Command Basics Tutorial",
    "Command Chains": "Command Chains",
    "Command Chains Tutorial": "Command Chains Tutorial",
    "Command Training Grounds": "Command Training Grounds",
    "Continue to the next lesson": "Continue to the next lesson",
    "Copy all the non-air blocks of that plushie into this water": "Copy all the non-air blocks of that plushie into this water",
    "Copy all the non-air blocks of that plushie into this water.": "%s.",
    "Copy the block data of the lectern block and paste it into a command block on top of the emerald block": "Copy the block data of the lectern block and paste it into a command block on top of the emerald block",
    "Copy the lectern data into a command block on the emerald block": "Copy the lectern data into a command block on the emerald block",
    "Copy the plushie into the water": "Copy the plushie into the water",
    "Create a dummy scoreboard objective named 'fun'": "Create a dummy scoreboard objective named '%s'",
    "Create a red stained glass outline in the volume between the shroomlights": "Create a red stained glass outline in the volume between the shroomlights",
    "Create a red stained glass outline in the volume between the shroomlights. It should end up surrounding the red nether bricks and replacing the shroomlights.": "%s. It should end up surrounding the red nether bricks and replacing the shroomlights.",
    "Destroy that block and replace it with air.": "Destroy that block and replace it with air.",
    "Destroy the netherite block and replace it with air": "Destroy the netherite block and replace it with air",
    "Do not use a repeating command block!": "Do not use a repeating command block!",
    "Don't worry, I've restored everything. Please be careful!": "Don't worry, I've restored everything. Please be careful!",
    "Each section of exercises correspond to a tutorial video. Whenever you are stuck, click the link to the video.": "Each section of exercises correspond to a tutorial video. Whenever you are stuck, click the link to the video.",
    "Enough of that. What do you think about my statue? I'm quite proud of it.": "Enough of that. What do you think about my statue? I'm quite proud of it.",
    "Execution Contexts": "Execution Contexts",
    "Execution Contexts Tutorial": "Execution Contexts Tutorial",
    "Feel free to rebuild the area in any way you want.": "Feel free to rebuild the area in any way you want.",
    "Fill that command block with a command to summon an exact copy of the axolotl!": "Fill that command block with a command to %s!",
    "Fill the area between the gold blocks with Nether Bricks": "Fill the area between the gold blocks with Nether Bricks",
    "Find and remove the misspelled scoreboard": "Find and remove the misspelled scoreboard",
    "Find out how many scoreboards there are, then set your 'fun' score to that number.": "Find out how many scoreboards there are, then %s.",
    "For our first exercise in this section, place a command block on the emerald block.": "For our first exercise in this section, place a command block on the emerald block.",
    "For the final exercise in this section you're going to need the copy block data keyboard combination.": "For the final exercise in this section you're going to need the copy block data keyboard combination.",
    "Give yourself a command block": "Give yourself a command block",
    "Give yourself a debug stick": "Give yourself a debug stick",
    "Give yourself a stack of red wool blocks": "Give yourself a stack of red wool blocks",
    "Give yourself a stone block": "Give yourself a stone block",
    "Great work!": "Great work!",
    "Have the command block leave a trail of gold blocks under your feet as you move around. When you are done, walk over to the copper block.": "Have the command block %s as you move around. When you are done, walk over to the copper block.",
    "Hello world": "Hello world",
    "Hello, and welcome to the Command Training Grounds!": "Hello, and welcome to the Command Training Grounds!",
    "Help! I tried to add a scoreboard about nice red flowers, but I made a typo.": "Help! I tried to add a scoreboard about nice red flowers, but I made a typo.",
    "Hey, there's a quick way to pass this exercise. Add the tag 'cheater' to yourself.": "Hey, there's a quick way to pass this exercise. %s.",
    "How are you going to eat all of those?": "How are you going to eat all of those?",
    "I feel like we're being watched! Kill all entities with the 'spy' tag.": "I feel like we're being watched! %s.",
    "I mean... if you don't want to!": "I mean... if you don't want to!",
    "I want a fun score too! Set the score for 'slicedlime' to 1337!": "I want a fun score too! %s!",
    "I've set a value to a name in that new 'fun' scoreboard of yours. Set your own score to the same value.": "I've set a value to a name in that new '%s' scoreboard of yours. %s.",
    "If that is successful, also make it give you a diamond shovel.": "If that is successful, also make it give you a diamond shovel.",
    "If that is successful, also make it give you a diamond shovel. When you are done, activate the chain.": "%s When you are done, activate the chain.",
    "If the link has scrolled off the top of the chat window, there is a sign in the play area you can click to get it back.": "If the link has scrolled off the top of the chat window, there is a sign in the play area you can click to get it back.",
    "If you already know some commands, keep completing the exercises until you encounter one you can't solve.": "If you already know some commands, keep completing the exercises until you encounter one you can't solve.",
    "If you need help upgrading the map, check out the video tutorial: ": "If you need help upgrading the map, check out the video tutorial: ",
    "If you want to be notified when new sections are added, subscribe to slicedlime on YouTube and make sure to enable alerts by clicking on the bell icon.": "If you want to be notified when new sections are added, subscribe to slicedlime on YouTube and make sure to enable alerts by clicking on the bell icon.",
    "In fact, I think it needs a display case. Please make a yellow glass box around it.": "In fact, I think it needs a display case. Please %s.",
    "In order for you to complete these exercises, it is important that you know how to look at the chat and click links in it.": "In order for you to complete these exercises, it is important that you know how to look at the chat and click links in it.",
    "It's a bit boring. Let's play a game of tags! Summon a skeleton without AI and with the 'archer' tag.": "It's a bit boring. Let's play a game of tags! %s.",
    "It's very empty here in this weird box. Let's make a friend - summon a cow without AI.": "It's very empty here in this weird box. Let's make a friend - %s.",
    "Kill all Endermen": "Kill all Endermen",
    "Kill all entities with the 'spy' tag": "Kill all entities with the '%s' tag",
    "Kill all spiders with the 'jumpy' tag": "Kill all spiders with the '%s' tag",
    "Kill all spiders within 3 blocks of a cat": "Kill all spiders within 3 blocks of a cat",
    "Kill all spiders within 3 blocks of a cat.": "%s.",
    "Kill the suspicious sheep": "Kill the suspicious sheep",
    "Leave a trail of gold blocks under your feet as you move": "Leave a trail of gold blocks under your feet as you move",
    "Let's get even more destructive. Kill all Endermen.": "Let's get even more destructive. %s.",
    "Let's get started! In order to proceed to the first exercise, click the link below.\n": "Let's get started! In order to proceed to the first exercise, %s.\n",
    "Let's have cats instead. Cats are nice! Oh no - these spiders might scare the cats!": "Let's have cats instead. Cats are nice! Oh no - these spiders might scare the cats!",
    "Let's practice changing scores - your score is changing all the time now. Help it out by adding 10 to your own score!": "Let's practice changing scores - your score is changing all the time now. Help it out by %s!",
    "Let's start making scoreboards! Create a dummy scoreboard objective named 'fun'.": "Let's start making scoreboards! %s.",
    "Look - a nice plushie has appeared! Wouldn't it be nicer if we had two of them though?": "Look - a nice plushie has appeared! Wouldn't it be nicer if we had two of them though?",
    "Look around - there's now a quartz pillar and an emerald block in the floor. For your next task, place a command block on top of the emerald block.": "Look around - there's now a quartz pillar and an emerald block in the floor. For your next task, place a command block on top of the emerald block.",
    "Look! Diamonds! In case of emergency - break glass, right? But wait, maybe we can get them without breaking anything.": "Look! Diamonds! In case of emergency - break glass, right? But wait, maybe we can get them without breaking anything.",
    "Make a chain placing iron, gold and diamond blocks above the first block": "Make a chain placing iron, gold and diamond blocks above the first block",
    "Make a chain starting with an impulse block on the emerald block that makes an identical copy on top of the gold blocks.": "Make a chain starting with an impulse block on the emerald block that makes an identical copy on top of the gold blocks.",
    "Make a chain that replicates the plushie": "Make a chain that replicates the plushie",
    "Make a chain that sets a mud block and gives a diamond shovel if successful": "Make a chain that sets a mud block and gives a diamond shovel if successful",
    "Make a command block change your game mode to adventure": "Make a command block change your game mode to adventure",
    "Make a command block place a diamond block 3 blocks above itself": "Make a command block place a diamond block 3 blocks above itself",
    "Make a command block place a diamond block at height 100 at its own location": "Make a command block place a diamond block at height 100 at its own location",
    "Make a command block that clones the pillar on top of itself": "Make a command block that clones the pillar on top of itself",
    "Make a command block that copies only the diamonds on top of itself": "Make a command block that copies only the diamonds on top of itself",
    "Make a command block that kills a random player": "Make a command block that kills a random player",
    "Make a command block that kills all Creepers closer than 20 blocks": "Make a command block that kills all Creepers closer than 20 blocks",
    "Make a command block that kills all players": "Make a command block that kills all players",
    "Make a command block that kills all spiders further away than 10 blocks": "Make a command block that kills all spiders further away than 10 blocks",
    "Make a command block that kills the Guardian furthest away": "Make a command block that kills the Guardian furthest away",
    "Make a command block that kills the closest two Witches": "Make a command block that kills the closest two Witches",
    "Make a command block that kills the nearest player": "Make a command block that kills the nearest player",
    "Make a command block that teleports a random rabbit on top of itself": "Make a command block that teleports a random rabbit on top of itself",
    "Make a command block to copy the axolotl": "Make a command block to copy the axolotl",
    "Make a red glass outline in the volume between the shroomlights": "Make a red glass outline in the volume between the shroomlights",
    "Make a repeating chain placing a bookshelf above the 2nd block, summon xp if successful": "Make a repeating chain placing a bookshelf above the 2nd block, summon xp if successful",
    "Make a repeating command block give you a cookie": "Make a repeating command block give you a cookie",
    "Make a repeating command block replace the emerald block with a gold block": "Make a repeating command block replace the emerald block with a gold block",
    "Make a repeating command block that replaces that emerald block with a gold block.": "Make a repeating command block that replaces that emerald block with a gold block.",
    "Make a square chain that gears you up": "Make a square chain that gears you up",
    "Make it midnight forever": "Make it midnight forever",
    "Make it stop": "Make it stop",
    "Make it thunder forever": "Make it thunder forever",
    "Make the chain give you an iron sword, a shield, a bow and a stack of arrows": "Make the chain give you an iron sword, a shield, a bow and a stack of arrows",
    "Make the chain place a bookshelf above the second block in the chain, and summon an xp orb on top of the bookshelf if that was successful.": "Make the chain place a bookshelf above the second block in the chain, and summon an xp orb on top of the bookshelf if that was successful.",
    "Make the chain place three blocks on top of each other above the first block, iron, gold and diamond from the bottom up.": "Make the chain place three blocks on top of each other above the first block, iron, gold and diamond from the bottom up.",
    "Make the chain replace the block below the first command block with a mud block.": "Make the chain replace the block below the first command block with a mud block.",
    "Make the chain replace the diamond block with a redstone block, then teleport you on top of that redstone block": "Make the chain replace the diamond block with a redstone block, then teleport you on top of that redstone block",
    "Make the command block clone the entire pillar to be on top of the command block itself, regardless of where it is placed.": "Make the command block %s, regardless of where it is placed.",
    "Make the command block give you a diamond sword": "Make the command block give you a diamond sword",
    "Make the command block place a diamond block 3 blocks above itself.": "Make the command block place a diamond block 3 blocks above itself.",
    "Make the command block say Hello world": "Make the command block say %s",
    "Make the command block use relative coordinates to replace the gold block with a diamond block.": "Make the command block use relative coordinates to replace the gold block with a diamond block.",
    "Make the rain stop": "Make the rain stop",
    "Make time pass": "Make time pass",
    "Make time pass again": "Make time pass again",
    "Move it one block down": "Move it one block down",
    "Move the plushie one block down": "Move the plushie one block down",
    "New emerald block! Make the new command block kill all Creepers closer than 20 blocks.": "New emerald block! Make the new command block %s.",
    "New emerald block! Place a command block on it and make it teleport a random rabbit to on top of the command block!": "New emerald block! Place a command block on it and make it %s!",
    "New emerald block! Place a command block on this one and make it kill all players!": "New emerald block! Place a command block on this one and make it %s!",
    "New gold block! Replace this one with an end rod pointing downwards.": "New gold block! %s.",
    "Next Section Coming Soon": "Next Section Coming Soon",
    "No cheating! That link belonged to a different exercise!": "No cheating! That link belonged to a different exercise!",
    "Notice how there are no mobs spawning on this map? Mob spawning is turned off. Turn it back on.": "Notice how there are no mobs spawning on this map? Mob spawning is turned off. %s.",
    "Now activate that command chain in survival mode": "Now %s",
    "Now give yourself a command block.": "Now %s.",
    "Now give yourself a debug stick.": "Now %s.",
    "Now give yourself an entire stack of red wool blocks.": "Now %s.",
    "Now place a command block that teleports you 3 blocks above it on the emerald block.": "Now %s on the emerald block.",
    "Now stand on the diamond block and activate the command block again.": "Now %s again.",
    "Now summon a Polar Bear": "Now %s",
    "Now switch into all the different game modes": "Now %s",
    "Now, place the command block on the emerald block and make the command block give you a diamond sword.": "Now, place the command block on the emerald block and %s.",
    "Oh - watch out, better disable the AI so it doesn't shoot you!": "Oh - watch out, better disable the AI so it doesn't shoot you!",
    "Oh my, that's a lot of cookies...": "Oh my, that's a lot of cookies...",
    "Oh my. Well - that is just a mess, isn't it?": "Oh my. Well - that is just a mess, isn't it?",
    "Oh no, you ended up inside a gold block! I've turned your command block off for now.": "Oh no, you ended up inside a gold block! I've turned your command block off for now.",
    "Oh, you seem to have killed more than just the spies! Try again!": "Oh, you seem to have killed more than just the spies! Try again!",
    "Okay, let's make it a bit harder! Place a new command block on the new emerald block.": "Okay, let's make it a bit harder! Place a new command block on the new emerald block.",
    "Okay, now make a command block on the new emerald block that kills all spiders further away than 10 blocks.": "Okay, now make a command block on the new emerald block that %s.",
    "Okay, this time place a command block that kills the closest two Witches.": "Okay, this time place a command block that %s.",
    "One final test for this time - check out the friendly Axo... axlol... pink boy over here! There's an emerald block nearby too - place a command block on that emerald block.": "One final test for this time - check out the friendly Axo... axlol... pink boy over here! There's an emerald block nearby too - place a command block on that emerald block.",
    "One last fill exercise. See that tree? I like the other nether leaves better. Replace all the wart blocks with warped warts.": "One last fill exercise. See that tree? I like the other nether leaves better. %s.",
    "One last gold block before we move on! Replace it with three lit light blue candles.": "One last gold block before we move on! %s.",
    "One more! Make this command block kill the Guardian that is the furthest away.": "One more! Make this command block %s.",
    "Oooh, our favorite plushie is back! It's floating off the floor though - that's no good. Move it one block down.": "Oooh, our favorite plushie is back! It's floating off the floor though - that's no good. %s.",
    "Our first exercise in this section involves destruction! See the netherite block that has appeared?": "Our first exercise in this section involves destruction! See the netherite block that has appeared?",
    "Our first exercise in this section will be to make a command block chain.": "Our first exercise in this section will be to make a command block chain.",
    "Place a command block on the emerald block that changes your game mode to adventure. Activate the block.": "Place a command block on the emerald block that %s. Activate the block.",
    "Place a command block on the emerald block. Make it clone only the diamond blocks to on top of the command block itself, regardless of where that command block is placed.": "Place a command block on the emerald block. Make it %s, regardless of where that command block is placed.",
    "Place a command block on the new emerald block that sets a diamond block at its own position, but at height 100.": "Place a command block on the new emerald block that sets a diamond block at its own position, but at height 100.",
    "Place a shroomlight above the head of all husks": "Place a shroomlight above the head of all husks",
    "Place a shroomlight above the head of all husks.": "%s.",
    "Place down the first command block in the chain on top of the emerald block. Activate it when done.": "Place down the first command block in the chain on top of the emerald block. Activate it when done.",
    "Please find and remove the misspelled scoreboard.": "Please %s.",
    "Relative Coordinates": "Relative Coordinates",
    "Relative Coordinates Tutorial": "Relative Coordinates Tutorial",
    "Remove 1 from the 'fun' score of all endermites": "Remove 1 from the '%s' score of all endermites",
    "Remove 1 from the 'fun' score of all endermites.": "%s.",
    "Remove the 'cheater' tag from yourself": "Remove the '%s' tag from yourself",
    "Remove the 'fun' score of 'boop' entirely": "Remove the '%s' score of '%s' entirely",
    "Repeating Commands": "Repeating Commands",
    "Repeating Commands Tutorial": "Repeating Commands Tutorial",
    "Replace all the leaves on the tree with warped wart blocks": "Replace all the leaves on the tree with warped wart blocks",
    "Replace all the wart blocks with warped warts": "Replace all the wart blocks with warped warts",
    "Replace all wolves with sheep": "Replace all wolves with sheep",
    "Replace it with a bone block oriented along the Z axis": "Replace it with a bone block oriented along the Z axis",
    "Replace it with a waterlogged lower cobblestone slab": "Replace it with a waterlogged lower cobblestone slab",
    "Replace it with three lit light blue candles": "Replace it with three lit light blue candles",
    "Replace the emerald block with a diamond block": "Replace the emerald block with a diamond block",
    "Replace the emerald block with a diamond block!": "Replace the emerald block with a diamond block!",
    "Replace the gold block with 3 lit light blue candles": "Replace the gold block with 3 lit light blue candles",
    "Replace the gold block with a bone block along the z axis": "Replace the gold block with a bone block along the z axis",
    "Replace the gold block with a waterlogged lower cobblestone slab": "Replace the gold block with a waterlogged lower cobblestone slab",
    "Replace the gold block with an end rod facing downwards": "Replace the gold block with an end rod facing downwards",
    "Replace the iron blocks with three connected chains": "Replace the iron blocks with three connected chains",
    "Replace the mess with a hollow box of orange glass": "Replace the mess with a hollow box of orange glass",
    "Replace the nether gold ore with ancient debris": "Replace the nether gold ore with ancient debris",
    "Replace them with chain blocks": "Replace them with chain blocks",
    "Replace this one with an end rod pointing downwards": "Replace this one with an end rod pointing downwards",
    "Run it if you want to I guess. See if I care.": "Run it if you want to I guess. See if I care.",
    "Scoreboards": "Scoreboards",
    "Scoreboards Tutorial": "Scoreboards Tutorial",
    "Section 1": "Section 1",
    "Section 1 - Command Basics": "Section 1 - Command Basics",
    "Section 10": "Section 10",
    "Section 10 - Scoreboards": "Section 10 - Scoreboards",
    "Section 2": "Section 2",
    "Section 2 - Repeating Commands": "Section 2 - Repeating Commands",
    "Section 3": "Section 3",
    "Section 3 - Command Chains": "Section 3 - Command Chains",
    "Section 4": "Section 4",
    "Section 4 - Relative Coordinates": "Section 4 - Relative Coordinates",
    "Section 5": "Section 5",
    "Section 5 - Block States": "Section 5 - Block States",
    "Section 6": "Section 6",
    "Section 6 - Changing the World": "Section 6 - Changing the World",
    "Section 7": "Section 7",
    "Section 7 - Selecting Entities": "Section 7 - Selecting Entities",
    "Section 8": "Section 8",
    "Section 8 - Summoning and Tagging Entities": "Section 8 - Summoning and Tagging Entities",
    "Section 9": "Section 9",
    "Section 9 - Execution Contexts": "Section 9 - Execution Contexts",
    "Selecting Entities": "Selecting Entities",
    "Selecting Entities Tutorial": "Selecting Entities Tutorial",
    "Seriously, no need. It's all on you.": "Seriously, no need. It's all on you.",
    "Set the 'fun' score for 'slicedlime' to 1337": "Set the '%s' score for '%s' to 1337",
    "Set the score for 'slicedlime' to 1337": "Set the score for '%s' to 1337",
    "Set your 'fun' score to the number of scoreboards": "Set your '%s' score to the number of scoreboards",
    "Set your 'fun' score to the same as the hidden score": "Set your '%s' score to the same as the hidden score",
    "Set your own score to the same value": "Set your own score to the same value",
    "Some blocks have shown up in the air - a sculpture of shroomlights and red nether bricks.": "Some blocks have shown up in the air - a sculpture of shroomlights and red nether bricks.",
    "Stand By": "Stand By",
    "Stand on the diamond block and activate the command block": "Stand on the diamond block and activate the command block",
    "Subscribe to slicedlime": "Subscribe to slicedlime",
    "Summon a Polar Bear": "Summon a Polar Bear",
    "Summon a cow without AI": "Summon a cow without AI",
    "Summon a rabbit with both the 'cute' and the 'jumpy' tags": "Summon a rabbit with both the '%s' and the '%s' tags",
    "Summon a rabbit with the 'cute' and 'jumpy' tags": "Summon a rabbit with the '%s' and '%s' tags",
    "Summon a skeleton without AI and with the 'archer' tag": "Summon a skeleton without AI and with the '%s' tag",
    "Summoning and Tagging Entities": "Summoning and Tagging Entities",
    "Summoning and Tagging Entities Tutorial": "Summoning and Tagging Entities Tutorial",
    "Surround the statue with a yellow glass box": "Surround the statue with a yellow glass box",
    "Switch it back on!": "Switch it back on!",
    "Switch the command block output game rule back on": "Switch the command block output game rule back on",
    "Switch to game modes: ": "Switch to game modes: ",
    "T (or the key you have rebound Open Chat to)": "T (or the key you have rebound Open Chat to)",
    "Teleport 3 blocks above the command block in survival mode": "Teleport 3 blocks above the command block in survival mode",
    "Teleport all bats two blocks upwards": "Teleport all bats two blocks upwards",
    "That cow isn't much fun, is it? Let's get a better friend. Summon a rabbit with both the 'cute' and the 'jumpy' tags.": "That cow isn't much fun, is it? Let's get a better friend. %s.",
    "That didn't teleport a rabbit to the right place!": "That didn't teleport a rabbit to the right place!",
    "That isn't quite the right way.": "That isn't quite the right way.",
    "That rabbit isn't the only cute little thing! Add the 'cute' tag to all cats!": "That rabbit isn't the only cute little thing! %s!",
    "That sheep is looking pretty sus. What evil deed is it planning? Better kill it.": "That sheep is looking pretty sus. What evil deed is it planning? Better %s.",
    "That teleported too many rabbits!": "That teleported too many rabbits!",
    "That was too many things you just called cute! Try again.": "That was too many things you just called cute! Try again.",
    "The endermites are invading your scoreboard! They're not as fun as they claim to be.": "The endermites are invading your scoreboard! They're not as fun as they claim to be.",
    "The time has stopped passing! Time to do something about that. Make time pass again.": "The time has stopped passing! Time to do something about that. %s.",
    "There are now two gold blocks in the floor. See them?": "There are now two gold blocks in the floor. See them?",
    "There are three iron blocks now. Replace them with chain blocks in such a way that it makes one long connected chain.": "There are three iron blocks now. %s in such a way that it makes one long connected chain.",
    "There is now some nether gold ore in the floor. That isn't so valuable though.": "There is now some nether gold ore in the floor. That isn't so valuable though.",
    "There's a couple of copper blocks now - place a chain of two blocks on top of them, starting on the unoxidized block.": "There's a couple of copper blocks now - place a chain of two blocks on top of them, starting on the unoxidized block.",
    "There's a gold block now. Replace it with a bone block oriented along the Z axis.": "There's a gold block now. %s.",
    "There's a lapis and copper block setup now - make a repeating chain this time.": "There's a lapis and copper block setup now - make a repeating chain this time.",
    "There's a sea pickle nearby now. Use the debug stick to make it 4 waterlogged sea pickles.": "There's a sea pickle nearby now. %s.",
    "There's an emerald block on the ground now. Place a command block on it and make it kill the nearest player.": "There's an emerald block on the ground now. Place a command block on it and make it %s.",
    "There's an emerald block on the island now. Replace the emerald block with a diamond block!": "There's an emerald block on the island now. %s",
    "There's an lapis block and a copper block now. For this next task, place a repeating command block on the lapis block.": "There's an lapis block and a copper block now. For this next task, place a repeating command block on the lapis block.",
    "There's now a lectern and an emerald block. Copy the block data of the lectern block and paste it into a command block on top of the emerald block.": "There's now a lectern and an emerald block. %s.",
    "There's now an emerald block and a lime stained glass block. Place a command block on the emerald block.": "There's now an emerald block and a lime stained glass block. Place a command block on the emerald block.",
    "These husks look like they need a bit of a cheering up. You know what's good for that? Shroomlights.": "These husks look like they need a bit of a cheering up. You know what's good for that? Shroomlights.",
    "This Nether needs more fire! Make it thunder forever!": "This Nether needs more fire! %s!",
    "This is the final exercise in this section. See how there are now copper blocks in the ground? To graduate from this part, your task is to make a command block chain on those blocks.": "This is the final exercise in this section. See how there are now copper blocks in the ground? To graduate from this part, your task is to make a command block chain on those blocks.",
    "This map along with its companion video series is meant to teach you how to use Minecraft commands.": "This map along with its companion video series is meant to teach you how to use Minecraft commands.",
    "This section covers game modes, teleporting players and command block chains.": "This section covers game modes, teleporting players and command block chains.",
    "This section covers game rules and repeating command blocks.": "This section covers game rules and repeating command blocks.",
    "This section covers relative coordinates, conditional command blocks and summoning entities.": "This section covers relative coordinates, conditional command blocks and summoning entities.",
    "This section covers setblock modes, block states and an introduction to block entity data.": "This section covers setblock modes, block states and an introduction to block entity data.",
    "This section covers the basics of scoreboards.": "This section covers the basics of scoreboards.",
    "This section covers the basics of the execute command, including the at and as subcommands.": "This section covers the basics of the execute command, including the at and as subcommands.",
    "This section covers the fill, clone, time and weather commands and related game rules.": "This section covers the fill, clone, time and weather commands and related game rules.",
    "This section covers the introduction to commands and command blocks.": "This section covers the introduction to commands and command blocks.",
    "This section covers the kill command, the @a, @p, @r, @e selectors and the distance, type, limit and sort selector arguments.": "This section covers the kill command, the @a, @p, @r, @e selectors and the distance, type, limit and sort selector arguments.",
    "This section covers the summon and tag commands, the tag selector argument, the Tags entity data entry and the doMobSpawning game rule.": "This section covers the summon and tag commands, the tag selector argument, the Tags entity data entry and the doMobSpawning game rule.",
    "To begin with, the command block output game rule has been switched off. Switch it back on!": "To begin with, the command block output game rule has been switched off. %s",
    "To open the chat window, press T (or the key you have rebound Open Chat to). This shows the entire chat window and frees up your mouse pointer so you can click things.": "To open the chat window, press %s. This shows the entire chat window and frees up your mouse pointer so you can click things.",
    "To see the tutorial video for this section, click the link below.": "To see the tutorial video for this section, click the link below.",
    "Try using the game mode switcher!": "Try using the game mode switcher!",
    "Turn it back on": "Turn it back on",
    "Turn mob spawning on": "Turn mob spawning on",
    "Upgrading Tutorial": "Upgrading Tutorial",
    "Use a fill command to replace all of them at once with ancient debris": "Use a fill command to replace all of them at once with ancient debris",
    "Use a fill command to replace all of them at once with ancient debris! Make sure to only replace the gold ore.": "%s! Make sure to only replace the gold ore.",
    "Use relative coordinates to make the command block replace the glass block with a crafting table, but only if that block space is air.": "Use relative coordinates to make the command block replace the glass block with a crafting table, but only if that block space is air.",
    "Use relative coordinates to replace the glass block with a crafting table if it is air": "Use relative coordinates to replace the glass block with a crafting table if it is air",
    "Use relative coordinates to replace the gold block with a diamond block": "Use relative coordinates to replace the gold block with a diamond block",
    "Use the debug stick to light the redstone lamp": "Use the debug stick to light the redstone lamp",
    "Use the debug stick to light the redstone lamp.": "Use the debug stick to light the redstone lamp.",
    "Use the debug stick to make 4 waterlogged sea pickles": "Use the debug stick to make 4 waterlogged sea pickles",
    "Use the debug stick to make it 4 waterlogged sea pickles": "Use the debug stick to make it 4 waterlogged sea pickles",
    "Wait a second - it isn't supposed to ever be day in the Nether. Make it midnight forever.": "Wait a second - it isn't supposed to ever be day in the Nether. %s.",
    "Wait, you're not a cheater, are you? Remove the 'cheater' tag from yourself.": "Wait, you're not a cheater, are you? %s.",
    "We can call this one \"a wolf in sheep's clothing\". Make the command chain replace all wolves with sheep.": "We can call this one \"a wolf in sheep's clothing\". Make the command chain %s.",
    "Well done!": "Well done!",
    "Well yes, you are also cute... but that wasn't the exercise!": "Well yes, you are also cute... but that wasn't the exercise!",
    "What, rain? In the Nether? That's no good. Make it stop.": "What, rain? In the Nether? That's no good. %s.",
    "When you are done, activate the block.": "When you are done, activate the block.",
    "When you are done, activate the chain.": "When you are done, activate the chain.",
    "When you are done, activate the command block in survival mode.": "When you are done, activate the command block in survival mode.",
    "When you are done, activate the command block.": "When you are done, activate the command block.",
    "When you are done, press the button on the diamond block.": "When you are done, press the button on the diamond block.",
    "When you are done, press the button on the diamond block. Make sure your commands work even if the original plushie does not exist.": "When you are done, press the button on the diamond block. Make sure your commands work even if the original plushie does not exist.",
    "Where did all these bats come from? Are they having trouble taking off? Help them out by teleporting them all two blocks upwards.": "Where did all these bats come from? Are they having trouble taking off? Help them out by %s.",
    "Who put 'boop' on that scoreboard? Please remove their score entirely!": "Who put '%s' on that scoreboard? Please %s!",
    "Whoops - that was the wrong selector! I've turned your command block off for now.": "Whoops - that was the wrong selector! I've turned your command block off for now.",
    "Whoops! Looks like you accidentaly killed an entity I need here.": "Whoops! Looks like you accidentaly killed an entity I need here.",
    "Whoops! Looks like you accidentaly messed up an entity I need here.": "Whoops! Looks like you accidentaly messed up an entity I need here.",
    "Whoops! Looks like you accidentaly removed a block I need here.": "Whoops! Looks like you accidentaly removed a block I need here.",
    "Whoops! Looks like you accidentaly removed one of the scoreboard objectives I need here.": "Whoops! Looks like you accidentaly removed one of the scoreboard objectives I need here.",
    "Whoops! You probably shouldn't jump with that thing active!": "Whoops! You probably shouldn't jump with that thing active!",
    "Yet another emerald block! Place a command block on this one and make it kill a random player!": "Yet another emerald block! Place a command block on this one and make it %s!",
    "You better replace it with a hollow box made of orange stained glass!": "You better %s!",
    "You can check if a newer version is out on the web page:": "You can check if a newer version is out on the web page:",
    "You can even see some of the internal secrets of the training grounds now!": "You can even see some of the internal secrets of the training grounds now!",
    "You don't need to run it.": "You don't need to run it.",
    "You don't need to... ah you know, whatever.": "You don't need to... ah you know, whatever.",
    "You know the drill - new copper blocks, time for a new chain. Use only relative coordinates in this one.": "You know the drill - new copper blocks, time for a new chain. Use only relative coordinates in this one.",
    "You know what I hate? Spiders. Jumpy spiders. Kill all spiders with the 'jumpy' tag.": "You know what I hate? Spiders. Jumpy spiders. %s.",
    "You know what this Nether needs more of? Water! And bathing plushies!": "You know what this Nether needs more of? Water! And bathing plushies!",
    "You must accept cookies to keep playing this map.": "You must accept cookies to keep playing this map.",
    "You must only place command blocks on top of the copper blocks. When you are done, activate it.": "You must only place command blocks on top of the copper blocks. When you are done, activate it.",
    "You seem to have killed more spiders than you should have. Try again!": "You seem to have killed more spiders than you should have. Try again!",
    "You still don't need to run it.": "You still don't need to run it.",
    "You've got the basics figured out! As a final task in this section, now make the command block say Hello world to chat.": "You've got the basics figured out! As a final task in this section, now %s.",
    "Your first task is to give yourself a stone block.": "Your first task is to %s.",
    "Your next task is to make a chain on the copper blocks. Start with an impulse block on the regular copper.": "Your next task is to make a chain on the copper blocks. Start with an impulse block on the regular copper.",
    "Your next task is to replace them and everything in between with nether bricks!": "Your next task is to %s!",
    "Your version of the Command Training Grounds map does not contain the next section.": "Your version of the Command Training Grounds map does not contain the next section.",
    "[Block States Tutorial]": "[%s]",
    "[Changing the World Tutorial]": "[%s]",
    "[Command Basics Tutorial]": "[%s]",
    "[Command Chains Tutorial]": "[%s]",
    "[Command Training Grounds]": "[%s]",
    "[Continue to the next lesson]": "[%s]",
    "[Execution Contexts Tutorial]": "[%s]",
    "[Relative Coordinates Tutorial]": "[%s]",
    "[Repeating Commands Tutorial]": "[%s]",
    "[Scoreboards Tutorial]": "[%s]",
    "[Selecting Entities Tutorial]": "[%s]",
    "[Subscribe to slicedlime]": "[%s]",
    "[Summoning and Tagging Entities Tutorial]": "[%s]",
    "[Upgrading Tutorial]": "[%s]",
    "activate that command chain in survival mode": "activate that command chain in survival mode",
    "adding 10 to your own score": "adding 10 to your own score",
    "archer": "archer",
    "boop": "boop",
    "changes your game mode to adventure": "changes your game mode to adventure",
    "cheater": "cheater",
    "click the link below": "click the link below",
    "clone only the diamond blocks to on top of the command block itself": "clone only the diamond blocks to on top of the command block itself",
    "clone the entire pillar to be on top of the command block itself": "clone the entire pillar to be on top of the command block itself",
    "cute": "cute",
    "find and remove the misspelled scoreboard": "find and remove the misspelled scoreboard",
    "fun": "fun",
    "give yourself a command block": "give yourself a command block",
    "give yourself a debug stick": "give yourself a debug stick",
    "give yourself a stone block": "give yourself a stone block",
    "give yourself an entire stack of red wool blocks": "give yourself an entire stack of red wool blocks",
    "jumpy": "jumpy",
    "kill a random player": "kill a random player",
    "kill all Creepers closer than 20 blocks": "kill all Creepers closer than 20 blocks",
    "kill all players": "kill all players",
    "kill it": "kill it",
    "kill the Guardian that is the furthest away": "kill the Guardian that is the furthest away",
    "kill the nearest player": "kill the nearest player",
    "kills all spiders further away than 10 blocks": "kills all spiders further away than 10 blocks",
    "kills the closest two Witches": "kills the closest two Witches",
    "leave a trail of gold blocks under your feet": "leave a trail of gold blocks under your feet",
    "make a repeating command block give you a cookie.": "make a repeating command block give you a cookie.",
    "make a yellow glass box around it": "make a yellow glass box around it",
    "make the command block give you a diamond sword": "make the command block give you a diamond sword",
    "make the command block say Hello world to chat": "make the command block say %s to chat",
    "place a command block that teleports you 3 blocks above it": "place a command block that teleports you 3 blocks above it",
    "remove their score entirely": "remove their score entirely",
    "replace all wolves with sheep": "replace all wolves with sheep",
    "replace it with a hollow box made of orange stained glass": "replace it with a hollow box made of orange stained glass",
    "replace them and everything in between with nether bricks": "replace them and everything in between with nether bricks",
    "set your 'fun' score to that number": "set your '%s' score to that number",
    "slicedlime": "slicedlime",
    "spy": "spy",
    "stand on the diamond block and activate the command block": "stand on the diamond block and activate the command block",
    "summon a Polar Bear": "summon a Polar Bear",
    "summon a cow without AI": "summon a cow without AI",
    "summon an exact copy of the axolotl": "summon an exact copy of the axolotl",
    "switch into all the different game modes": "switch into all the different game modes",
    "teleport a random rabbit to on top of the command block": "teleport a random rabbit to on top of the command block",
    "teleporting them all two blocks upwards": "teleporting them all two blocks upwards"
}